Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: you detect the need to delete a Widget in a thread other than the thread making LVGL calls (e.g. in a case where you are using a :ref:`Gateway Thread <Gateway Thread>` to make all LVGL calls in a multi-threaded environment).
it_it: si rileva la necessità di eliminare un Widget in un thread diverso da quello che effettua le chiamate LVGL (ad esempio, nel caso in cui si utilizzi un :ref:`Gateway Thread <Gateway Thread>` per effettuare tutte le chiamate LVGL in un ambiente multi-thread).

source: you don't want to block execution now, or
it_it: non si vuole bloccare l'esecuzione ora, oppure

source: you will have a ``LV_FS_xxx_PATH`` macro available to you in ``lv_conf.h`` that you can use to provide a path that gets dynamically prefixed to the ``path_to_file`` portion of of the path strings provided to ``lv_fs_...()`` functions when files and directories are opened.
it_it: sarà disponibile una macro ``LV_FS_xxx_PATH`` in ``lv_conf.h`` utilizzabile per fornire un path che viene aggiunto dinamicamente come prefisso alla porzione ``path_to_file`` delle stringhe di path fornite alle funzioni ``lv_fs_...()`` quando vengono aperti file e directory.

source: you will need to complete a few more steps to get your project up and running with LVGL.
it_it: saranno necessari alcuni passaggi aggiuntivi per avviare il progetto con LVGL.

source: you will receive an email with an OTP (One-Time Password)
it_it: si riceverà un'email con una OTP (One-Time Password)

source: |lvglpro| Opening User Interface
it_it: |lvglpro| Interfaccia Utente Iniziale

source: |lvglpro| User Interface
it_it: |lvglpro| Interfaccia Utente

source: |lvglpro| handles (and updates) the container automatically in the background.
it_it: |lvglpro| gestisce (e aggiorna) il container automaticamente in background.

source: |lvglpro| has the usual File / View / Edit / etc. application menu.
it_it: |lvglpro| presenta il consueto menù File / View / Edit / ecc.

source: |lvglpro|'s Editor is an XML editor to simplify and speed up building embedded UIs.
it_it: L'Editor di |lvglpro| è un editor XML per semplificare e velocizzare la creazione di interfacce utente embedded.

source: |lvglpro|\ 's `Figma <https://www.figma.com/community/plugin/1362005814860504095/ figma-to-lvgl>`__ plugin displays the style properties of selected UI elements in Figma.
it_it: Il plugin `Figma <https://www.figma.com/community/plugin/1362005814860504095/ figma-to-lvgl>`__ di |lvglpro|\ visualizza le proprietà di stile degli elementi dell'interfaccia utente selezionati in Figma.
